// логическое ИЛИ работает слева направо
// ищет первый попавшийся трушный операнд и возвращает его

// let q = {} || 'x'
// q

// как различить блок стейтмент от пустого объекта

// контекст объекта (object constructor)
// {
//   x: 42
// }
// let x = {}
// console.log({})
// return {}

//
// контекст блок стейтмента
// {
//   return
// }
// if (true) {
//   x: 42
// }

// function methodName() {
//   x: 42
// }

// let o = {
//   return
// }

// let n = 42
// let s = `=${n}=` // шаблонный литерал
// s
